* Introduction

The following steps create an environment for coupled ModelE/PISM runs. At the end of this, you should have a folder structure that looks like the following in your =${LIME_ROOT}= location:

#+BEGIN_SRC bash :exports both :results verbatim :dir ~/projects/GISS/LIME
find . -maxdepth 2 -type d | grep -v git
#+END_SRC

#+RESULTS:
#+begin_example
./opt
./opt/include
./opt/bin
./opt/pylib
./opt/lib
./opt/share
./src
./src/blitz
./src/petsc-3.7.7
./src/ibmisc
./src/modelE
./src/netcdf-c-4.4.0
./src/cgal-releases-CGAL-4.12.2
./src/boost_1_82_0
./src/hdf5
./src/pnetcdf-1.11.0
./src/netcdf-cxx4-4.3.0
./src/icebin
./src/googletest
./src/everytrace
./src/netcdf-fortran-4.4.4
./src/hypre
./src/pism
#+end_example

** Working folders

Warning - if you build everything from scratch, the following should work. If you use some things that I have installed into my =${LIME_ROOT}= and sub-folders, you'll need to carefully pick when to use my =${LIME_ROOT}= and when to use your own location for =ModelE=, =PISM=, or other tools that you set up for your own development.

Everything is compiled and run from =${LIME_ROOT}/src=

On my local laptop, I work in =~/projects/GISS/LIME=, and have the following in =~/projects/GISS/LIME/.envrc= and use https://direnv.net/ to auto-activate it when I am in that or a subfolder. 

#+BEGIN_SRC bash :exports results :results verbatim
cat ~/projects/GISS/LIME/.envrc
#+END_SRC

#+RESULTS:
#+begin_example
export LIME_ROOT=/home/kdm/projects/GISS/LIME
export LD_LIBRARY_PATH=${LIME_ROOT}/opt/lib:${LD_LIBRARY_PATH}
export PATH=${LIME_ROOT}/opt/bin:${PATH}
export MODELERC=${PWD}/modelErc
export MAMBA_ENV=${HOME}/local/mambaforge/envs

# no `module load` on Laptop; Compilers are in default PATH or adjusted PATH above
## module purge
## Intel
## module load comp/intel/20.0.0.166 mpi/impi/20.0.0.166 cmake/3.23.1
## GCC
## module load comp/gcc/12.1.0 cmake/3.23.1
#+end_example

On =discover=, I work in =${NOBACKUP}/LIME=, and have the following in =${NOBACKUP}/LIME/.envrc=

#+HEADER: :prologue "ssh discover"
#+BEGIN_SRC bash :exports results :results verbatim
cat /discover/nobackup/kmankoff/LIME_intel/.envrc
#+END_SRC

#+RESULTS:
#+begin_example

export LIME_ROOT=${NOBACKUP}/LIME_intel
export MAMBA_ENV=${NOBACKUP}/local/mambaforge/envs
export LD_LIBRARY_PATH=${LIME_ROOT}/opt/lib:${LD_LIBRARY_PATH}

export PATH=${LIME_ROOT}/opt/bin:${PATH}

module purge

# module load comp/gcc/9.2.0 
module load comp/intel/20.0.0.166 mpi/impi/20.0.0.166 cmake/3.23.1

# Put a modelErc in each working folder if necessary
export MODELERC=${PWD}/modelErc

#+end_example

** netcdf-cxx-4.3.0

#+BEGIN_SRC bash :exports both :results verbatim
cd ${LIME_ROOT}/src
wget https://github.com/Unidata/netcdf-cxx4/archive/refs/tags/v4.3.0.tar.gz -O netcdf-cxx4-4.3.0.tar.gz
tar zxvf netcdf-cxx4-4.3.0.tar.gz
cd netcdf-cxx4-4.3.0

mkdir build
cd build

[[ $(basename $(pwd)) == "build" ]] && rm -fR *

cmake .. \
  -D CMAKE_INSTALL_PREFIX=${LIME_ROOT}/opt \
  -D CMAKE_INSTALL_LIBDIR=${LIME_ROOT}/opt/lib \
  -D CMAKE_C_FLAGS="-fPIC" \
  -D CMAKE_VERBOSE_MAKEFILE=ON \
  -D CMAKE_C_COMPILER=mpiicc \
  -D CMAKE_CXX_COMPILER=mpiicpc \
  -D CMAKE_IGNORE_PATH="/usr;/lib;/;/lib/x86_64-linux-gnu" \
  -D NETCDF_C_LIBRARY=${LIME_ROOT}/opt/lib/libnetcdf.so \

make -j
make install
#+END_SRC

The =CMAKE_IGNORE_PATH= stops cmake from linking to the system =libnetcdf.so= file.

#+BEGIN_SRC bash :exports both :results verbatim
ldd ../lime/opt/lib/libnetcdf-cxx4.so | grep netcdf
#+END_SRC

#+RESULTS:
: 	libnetcdf.so.11 => /path/to/lime/opt/lib/libnetcdf.so.11 (0x00007f62e1b04000)

*** Local

#+NAME: modelErc
#+BEGIN_SRC bash :exports both :results verbatim
export MODELERC=~/projects/GISS/LIME/modelErc # local
grep -v "^#" ${MODELERC} | grep -v "^$"
#+END_SRC

#+RESULTS: modelErc
#+begin_example
DECKS_REPOSITORY=/home/kdm/projects/GISS/ModelE_Support/prod_decks
CMRUNDIR=/home/kdm/projects/GISS/ModelE_Support/prod_runs
GCMSEARCHPATH=/home/kdm/projects/GISS/ModelE_Support/prod_input_files
EXECDIR=/home/kdm/projects/GISS/ModelE_Support/exec
SAVEDISK=/home/kdm/projects/GISS/ModelE_Support/huge_space
NETCDFHOME=/home/kdm/projects/GISS/LIME/opt
MPI=YES
MPIDISTR=openmpi
MPIDIR=/home/kdm/projects/GISS/LIME/opt
ABI=64
COMPILER=gfortran
MAILTO=
UMASK=022
OVERWRITE=NO
OUTPUT_TO_FILES=YES
VERBOSE_OUTPUT=YES
LILIBSDIR=/home/kdm/projects/GISS/LIME/opt
#+end_example

*** discover

#+HEADER: :prologue "ssh discover -t \"cd; bash --login\""
#+BEGIN_SRC bash :exports results :results verbatim
export MODELERC=~/projects/GISS/LIME_intel/modelErc # local
grep -v "^#" ${MODELERC} | grep -v "^$"
#+END_SRC

#+RESULTS:
#+begin_example
DECKS_REPOSITORY=/discover/nobackup/kmankoff/ModelE_Support/prod_decks
CMRUNDIR=/discover/nobackup/kmankoff/ModelE_Support/prod_runs
GCMSEARCHPATH=/discover/nobackup/projects/giss/prod_input_files
EXECDIR=/discover/nobackup/kmankoff/ModelE_Support/exec
SAVEDISK=/discover/nobackup/kmankoff/ModelE_Support/huge_space
NETCDFHOME=/discover/nobackup/kmankoff/LIME_intel/opt
MPI=YES
MPIDISTR=intel
ABI=64
COMPILER=intel
MAILTO=mankoff@gmail.com
UMASK=022
OVERWRITE=NO
OUTPUT_TO_FILES=NO
VERBOSE_OUTPUT=YES
LILIBSDIR=/discover/nobackup/kmankoff/LIME_intel/opt
QSUB_STRING="sbatch --qos=debug -A s1001 -C sky -n %np -t %t "
QSUB_STRING_nobatch=""
QSUB_STRING_general="sbatch -A s1001 -C sky -n %np -t %t "
QSUB_STRING_giss="sbatch --qos=giss -A s1001 -C sky -n %np -t %t "
#+end_example

